Documents/ЗаказыКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗаказыКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АптечныйПункт_Потрибитель</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыПродаж</xr:Item>
				<xr:Item>AccumulationRegister.РегистрПрибыли</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиЗаявки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АптечныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокОтделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВладельцыКлубныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Корзина</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказыКлиента/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПересчитатьСумму();	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСумму()
	Сумма=0;
	Корзина=Объект.Корзина;
	Для каждого Строка Из Корзина Цикл
	     Сумма=Сумма+Строка.Сумма
	 КонецЦикла;
	 Объект.СуммаЗаказа=Сумма;
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Сообщить("2у");
КонецПроцедуры

&НаКлиенте
Процедура КорзинаКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Корзина.ТекущиеДанные;
	ФункцииДляРаботыСДокументами.РассчитатьСуммуПродажаЗаказ(СтрокаТабличнойЧасти);
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура КорзинаЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Корзина.ТекущиеДанные;
	ФункцииДляРаботыСДокументами.РассчитатьСуммуПродажаЗаказ(СтрокаТабличнойЧасти);
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура КорзинаТоварПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Корзина.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена=СерверныеФункции.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Товар);
	ФункцииДляРаботыСДокументами.РассчитатьСуммуПродажаЗаказ(СтрокаТабличнойЧасти);
	ПересчитатьСумму();
КонецПроцедуры
